In [ ]:
# SQL USING SQLITE3

In [6]:
# The code was removed by Watson Studio for sharing.

,Title,Release Year,Locations,Fun Facts,Production Company,Distributor,Director,Writer,Actor 1,Actor 2,Actor 3
0,180,2011,555 Market St.,NaN,SPI Cinemas,NaN,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
1,180,2011,Randall Museum,NaN,SPI Cinemas,NaN,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
2,180,2011,City Hall,NaN,SPI Cinemas,NaN,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
3,180,2011,Polk & Larkin Streets,NaN,SPI Cinemas,NaN,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
4,180,2011,Epic Roasthouse (399 Embarcadero),NaN,SPI Cinemas,NaN,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand

In [2]:
import sqlite3 #IMPORTING SQLITE

In [3]:
from pathlib import Path
Path('myfirstdb.db').touch() #CREATING MY FIRST DATABASE

In [4]:
conn = sqlite3.connect('myfirstdb.db') #CONNECTING WITH THE DATABASE
c = conn.cursor()

In [5]:
# Defining Functions

def open_db():
    conn = sqlite3.connect(path)
    c = conn.cursor()

def close_db():    
    return c.close()
    return conn.close()

def save():
    return conn.commit()
    
def run(*args):
    return c.execute(*args)

In [8]:
# write the data to an sqlite table

LA.to_sql('LA', conn, if_exists='append', index = False) # to_sql used to write dataframe to DB

/opt/conda/envs/Python-3.7-main/lib/python3.7/site-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [ ]:
# SELECT statement

In [9]:
# Fetch all record from LA table.

all_record = c.execute('''SELECT * FROM LA''').fetchall()

In [ ]:
for data in all_record:
    print(data)

In [ ]:
# Converting the data into a dataframe

In [11]:
table = pd.DataFrame(all_record) # A dataframe output
table

,0,1,2,3,4,5,6,7,8,9,10
0,180,2011,555 Market St.,None,SPI Cinemas,None,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
1,180,2011,Randall Museum,None,SPI Cinemas,None,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
2,180,2011,City Hall,None,SPI Cinemas,None,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
3,180,2011,Polk & Larkin Streets,None,SPI Cinemas,None,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
4,180,2011,Epic Roasthouse (399 Embarcadero),None,SPI Cinemas,None,Jayendra,"Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba",Siddarth,Nithya Menon,Priya Anand
...,...,...,...,...,...,...,...,...,...,...,...
3409,Woman on Top,2000,312 Fillmore Street,None,Fox Searchlight Pictures,Fox Searchlight Pictures,Fina Torres,Vera Blasi,Penelope Cruz,None,None
3410,"Yours, Mine and Ours",1968,None,None,Desilu Productions,United Artists,Melville Shavelson,"Bob Carroll, Jr.",Lucille Ball,Henry Fonda,Van Johnson
3411,"Yours, Mine and Ours",1968,None,None,Desilu Productions,United Artists,Melville Shavelson,"Bob Carroll, Jr.",Lucille Ball,Henry Fonda,Van Johnson
3412,Zodiac,2007,SF Chronicle Building (901 Mission St),None,Paramount Pictures,Paramount Pictures,David Fincher,James Vanderbilt,Jake Gyllenhaal,Mark Ruffalo,None
3413,Zodiac,2007,SF Chronicle Building (901 Mission St),None,Paramount Pictures,Paramount Pictures,David Fincher,James Vanderbilt,Jake Gyllenhaal,Mark Ruffalo,None

In [12]:
save() #Saves changes to the database using the user-defined function

In [13]:
c.execute('''ALTER TABLE LA RENAME COLUMN `Actor 1` TO MainActor''') # Renaming the column name.

In [14]:
some_record = run('''SELECT Title, Locations, `Actor 2` FROM LA LIMIT 10''') # PUTTING VALUES CONTAINING SPACE INTO (``) MAKES THE QUERY EXECUTABLE.

In [15]:
for item in some_record:
    print(item)

('180', '555 Market St.', 'Nithya Menon')
('180', 'Randall Museum', 'Nithya Menon')
('180', 'City Hall', 'Nithya Menon')
('180', 'Polk & Larkin Streets', 'Nithya Menon')
('180', 'Epic Roasthouse (399 Embarcadero)', 'Nithya Menon')
('180', 'Justin Herman Plaza', 'Nithya Menon')
('180', '200 block Market Street', 'Nithya Menon')
('180', 'Mason & California Streets (Nob Hill)', 'Nithya Menon')
('180', 'Epic Roasthouse (399 Embarcadero)', 'Nithya Menon')
('180', 'Mason & California Streets (Nob Hill)', 'Nithya Menon')

In [27]:
Schema = c.execute(''' PRAGMA table_info("LA")''') # Schema of the Table using PRAGMA

for obj in Schema:
    print (obj) # To print out the column names only *obj[1]* should be used

(0, 'Title', 'TEXT', 0, None, 0)
(1, 'Release Year', 'INTEGER', 0, None, 0)
(2, 'Locations', 'TEXT', 0, None, 0)
(3, 'Fun Facts', 'TEXT', 0, None, 0)
(4, 'Production Company', 'TEXT', 0, None, 0)
(5, 'Distributor', 'TEXT', 0, None, 0)
(6, 'Director', 'TEXT', 0, None, 0)
(7, 'Writer', 'TEXT', 0, None, 0)
(8, 'MainActor', 'TEXT', 0, None, 0)
(9, 'Actor 2', 'TEXT', 0, None, 0)
(10, 'Actor 3', 'TEXT', 0, None, 0)

In [16]:
title_release = c.execute('''SELECT Title, `Release Year` FROM LA''').fetchone() #Fetchone fetches one item from the table

In [17]:
fun_Prod = c.execute('''SELECT `Production Company`, `Fun Facts` FROM LA''').fetchmany(20) #Fetchmany is used to retrieve more than one item, and the number of items needed can be specified, in this case (20)

for obj in fun_Prod:
    print (obj)

('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('SPI Cinemas', None)
('Yerba Buena Productions', None)
('Yerba Buena Productions', None)
('Miramax Films', 'Francis Ford Coppola allegedly wrote large portions of "The Godfather" trilogy in Café Trieste.')
('Miramax Films', 'Established in 1867, Buena Vista Park is the oldest official park in San Francisco.')

In [18]:
Write_Act = run('''SELECT Writer, `Actor 2` FROM LA LIMIT 20''')  #LIMITS THE NUMBER OF OUTPUT TO 20

In [19]:
for obj in Write_Act:
    print (obj)

('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
('Umarji Anuradha, Jayendra, Aarthi Sriram, & Suba ', 'Nithya Menon')
(None, None)
(None, None)
('Robert Perez', 'Shaynnyn Sossamon')
('Robert Perez', 'Shaynnyn Sossamon')

# COUNT, DISTINCT, LIMIT statements

In [20]:
count = run(''' SELECT COUNT (*) FROM LA''') # Counts all the rows in the table
for item in count:
    print (item)

(3414,)

In [24]:
# The number of locations of the films which are written by James Cameron.

JC_Count = run('''SELECT COUNT (Locations) FROM LA WHERE Writer = 'James Cameron' ''')
for item in JC_Count:
    print (item)

(48,)

In [25]:
# The number of films shot at Russian Hill.

RH_Count = c.execute('''SELECT COUNT (*) FROM LA WHERE  Locations = 'Russian Hill' ''')
for item in RH_Count:
    print (item)

(1,)

# DISTINCT statement

In [ ]:
# Name of all films without any repeated titles.

Titles_ = run('''SELECT DISTINCT (Title) FROM LA''').fetchall()
for item in Titles_:
    print (item)

In [33]:
T_itles = pd.DataFrame(Titles_)
T_itles

                          0
0                       180
1    24 Hours on Craigslist
2     40 Days and 40 Nights
3                  48 Hours
4            50 First Dates
..                      ...
311            When We Rise
312        Woman on the Run
313            Woman on Top
314    Yours, Mine and Ours
315                  Zodiac

[316 rows x 1 columns]

In [37]:
# The name of all unique films released in the 21st century and onwards, along with their release years

Unique_films = run('''SELECT DISTINCT (Title), `Release Year` FROM LA WHERE `Release Year` >2000 ''').fetchall()

In [38]:
U_films = pd.DataFrame(Unique_films)
U_films

                             0     1
0                          180  2011
1       24 Hours on Craigslist  2005
2        40 Days and 40 Nights  2002
3               50 First Dates  2004
4                  About a Boy  2014
..                         ...   ...
119       Under the Tuscan Sun  2003
120                      Venom  2018
121  What the Bleep Do We Know  2004
122               When We Rise  2017
123                     Zodiac  2007

[124 rows x 2 columns]

In [68]:
# The first 15 rows from the table starting from row 44

row_44 = c.execute('''SELECT * FROM LA LIMIT 15 OFFSET 44''').fetchall()

In [69]:
_row44 = pd.DataFrame(row_44)
_row44

,0,1,2,3,4,5,6,7,8,9,10
0,A Jitney Elopement,1915,20th and Folsom Streets,None,The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
1,A Jitney Elopement,1915,Golden Gate Park,"During San Francisco's Gold Rush era, the Park...",The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
2,A Jitney Elopement,1915,Golden Gate Park,"During San Francisco's Gold Rush era, the Park...",The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
3,A Jitney Elopement,1915,20th and Folsom Streets,None,The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
4,Alcatraz,2012,Chestnut St. from Larkin to Columbus,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
5,Alcatraz,2012,Taylor St. from Broadway to Filbert,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
6,Alcatraz,2012,Francisco St from Larkin to Polk,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
7,Alcatraz,2012,Broadway from Mason to Taylor,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
8,Alcatraz,2012,Leavenworth from Filbert & Francisco St,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
9,Alcatraz,2012,Filbert St. from Jones to Mason,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
10,Alcatraz,2012,Filbert St. from Jones to Mason,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
11,Alcatraz,2012,Leavenworth from Filbert & Francisco St,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
12,Alcatraz,2012,Broadway from Mason to Taylor,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
13,Alcatraz,2012,Francisco St from Larkin to Polk,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None
14,Alcatraz,2012,Taylor St. from Broadway to Filbert,None,Bonanza Productions Inc.,Warner Bros. Television,J.J. Abrams,Steven Lilien,Sarah Jones,Jorge Garcia,None

In [70]:
save()

# INSERT, UPDATE AND DELETE Statement

In [71]:
c.execute('''CREATE TABLE INFO (ID REAL, NAME TEXT, EMAIL TEXT, CITY TEXT, COUNTRY TEXT)''') #Creating an empty table called INFO

In [77]:
# Populating the table

run(''' INSERT INTO INFO (ID, NAME, EMAIL, CITY, COUNTRY) VALUES 
                (11, 'BAYL', '`AAA@GMAIL.COM`', 'CALGARY', 'CANADA'),
                (22, 'JOSH', '`BBB@GMAIL.COM`', 'BURNABY', 'CANADA'),
                (33, 'WATZ', '`CCC@GMAIL.COM`', 'WATERLOO', 'CANADA')
    ''')

In [78]:
Schema = c.execute(''' PRAGMA table_info("INFO")''')

for obj in Schema:
    print (obj)

(0, 'ID', 'REAL', 0, None, 0)
(1, 'NAME', 'TEXT', 0, None, 0)
(2, 'EMAIL', 'TEXT', 0, None, 0)
(3, 'CITY', 'TEXT', 0, None, 0)
(4, 'COUNTRY', 'TEXT', 0, None, 0)

In [90]:
INFO = run (''' SELECT * FROM INFO''') #Reading the table
for item in INFO:
    print (item)

(22.0, 'JOSH', 'BBB@GMAIL.COM', 'BURNABY', 'CANADA')
(33.0, 'WATZ', 'CCC@GMAIL.COM', 'WATERLOO', 'CANADA')
(44.0, 'BAYL', 'DDD@GMAIL.COM', 'CALGARY', 'CANADA')

In [83]:
run (''' UPDATE INFO SET NAME = "JOHN" WHERE ID = 11.0''') # Updating the table, Syntax= {UPDATE table_name SET column_name WHERE condition}

In [91]:
INFO = run (''' SELECT * FROM INFO''')
for item in INFO:
    print (item)

(22.0, 'JOSH', 'BBB@GMAIL.COM', 'BURNABY', 'CANADA')
(33.0, 'WATZ', 'CCC@GMAIL.COM', 'WATERLOO', 'CANADA')
(44.0, 'BAYL', 'DDD@GMAIL.COM', 'CALGARY', 'CANADA')

In [85]:
# Populating table

run(''' INSERT INTO INFO (ID, NAME, EMAIL, CITY, COUNTRY) VALUES 
                (44, 'BAYL', 'DDD@GMAIL.COM', 'CALGARY', 'CANADA')
                
    ''')

In [86]:
c.execute (''' DELETE FROM INFO WHERE ID=11.0''')

In [92]:
INFO = run (''' SELECT * FROM INFO''')
for item in INFO:
    print (item)

(22.0, 'JOSH', 'BBB@GMAIL.COM', 'BURNABY', 'CANADA')
(33.0, 'WATZ', 'CCC@GMAIL.COM', 'WATERLOO', 'CANADA')
(44.0, 'BAYL', 'DDD@GMAIL.COM', 'CALGARY', 'CANADA')